In [1]:
import pandas as pd
import numpy as np

### Access the data from csv

1. pd.read_csv("filename") or pd.read_csv(path)

In [2]:
df=pd.read_csv("Datasets\studentdata.csv")
df

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [3]:
# convert csv file to excel
df.to_excel("studentdata.xlsx")

In [19]:
df2=pd.read_excel('studentdata.xlsx')
df2

   Unnamed: 0  sno  sname  sage
0           0  101  rahul    12
1           1  102   rani    13
2           2  103   raju    14

In [20]:
df2=df2.drop('Unnamed: 0',axis=1)
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [21]:
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [22]:
df2.drop([1])

   sno  sname  sage
0  101  rahul    12
2  103   raju    14

In [28]:
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [34]:
df2.drop('sno',axis=1)

   sname  sage
0  rahul    12
1   rani    13
2   raju    14

In [38]:
#df2.drop(df2.iloc[0],axis=1)
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [39]:
df2.drop(2)

   sno  sname  sage
0  101  rahul    12
1  102   rani    13

In [40]:
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [41]:
df2.loc[1:2]

   sno sname  sage
1  102  rani    13
2  103  raju    14

In [42]:
df2=df2.set_index('sno')
df2

     sname  sage
sno
101  rahul    12
102   rani    13
103   raju    14

In [45]:
df2.loc[101:102]

     sname  sage
sno
101  rahul    12
102   rani    13

In [48]:
df2.reset_index(inplace=True)

In [49]:
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [52]:
df2.loc[1:2,"sno":"sname"]

   sno sname
1  102  rani
2  103  raju

In [54]:
df2.iloc[1:2,0:2]

   sno sname
1  102  rani

In [55]:
df2=pd.read_excel('studentdata.xlsx')
df2

   Unnamed: 0  sno  sname  sage
0           0  101  rahul    12
1           1  102   rani    13
2           2  103   raju    14

In [56]:
df2.to_csv("st.csv")

In [58]:
df2=df2.drop('Unnamed: 0',axis=1)
df2

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

### JSON

* java script object notation

1. json array => []
2. json object => {}
3. json string => "key":"value"

In [61]:
json_data=df2.to_json(orient='records')

In [62]:
json_data

'[{"sno":101,"sname":"rahul","sage":12},{"sno":102,"sname":"rani","sage":13},{"sno":103,"sname":"raju","sage":14}]'

In [63]:
df3=pd.read_json(json_data)
df3

   sno  sname  sage
0  101  rahul    12
1  102   rani    13
2  103   raju    14

In [1]:
#help(df3)

In [65]:
df4=pd.read_html('https://en.wikipedia.org/wiki/Table_(information)')
df4

[  First name   Last name  Age
 0       Tinu    Elejogun   14
 1     Javier      Zapata   28
 2       Lily   McGarrett   18
 3  Olatunkbo    Chijiaku   22
 4   Adrienne    Anthoula   22
 5     Axelia  Athanasios   22
 6  Jon-Kabat        Zinn   22
 7    Thabang       Mosoa   15
 8   Kgaogelo       Mosoa   11,    ×  1  2  3
 0  1  1  2  3
 1  2  2  4  6
 2  3  3  6  9,                          0             1  \
 0  Standard Representation           NaN
 1                    3 2 1           NaN
 2              Health Risk  Flammability
 3                  Level 3       Level 2

                                                    2        3
 0                             Tabular Representation      NaN
 1  Risk levels of hazardous materials in this fac...      NaN
 2                                         Reactivity  Special
 3                                            Level 1      NaN  ,   Health Risk Flammability Reactivity  Special
 0     Level 3      Level 2    Level 1      NaN,     0                                                  1
 0 NaN  Look up table in Wiktionary, the free dictionary.,   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}.mw-parser-output .infobox .navbar{font-size:100%}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}vteVisualization of technical information  \
 0                                             Fields
 1                                        Image types
 2                                             People
 3                                     Related topics

   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}.mw-parser-output .infobox .navbar{font-size:100%}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}vteVisualization of technical information.1
 0  Biological data visualization Chemical imaging...
 1  Chart Diagram Engineering drawing Graph of a f...
 2  Jacques Bertin Cynthia Brewer Stuart Card Shee...
 3  Cartography Chartjunk Computer graphics in com...                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                ]

In [66]:
type(df4)

list

In [67]:
df4[0]

  First name   Last name  Age
0       Tinu    Elejogun   14
1     Javier      Zapata   28
2       Lily   McGarrett   18
3  Olatunkbo    Chijiaku   22
4   Adrienne    Anthoula   22
5     Axelia  Athanasios   22
6  Jon-Kabat        Zinn   22
7    Thabang       Mosoa   15
8   Kgaogelo       Mosoa   11

In [69]:
df4=pd.read_html('https://en.wikipedia.org/wiki/Table_(information)',match='Multiplication table')
df4[0]

   ×  1  2  3
0  1  1  2  3
1  2  2  4  6
2  3  3  6  9

In [71]:
df5=pd.read_html("https://en.wikipedia.org/wiki/The_Greatest_Indian")
df5[0]

,Rank,Image,Name,State,Notability
0,1,NaN,B. R. Ambedkar (1891–1956),Maharashtra,"Ambedkar is recognised as the ""founding father..."
1,2,NaN,A. P. J. Abdul Kalam(1931–2015),Tamil Nadu,"Aerospace and defence scientist, Kalam was inv..."
2,3,NaN,Vallabhbhai Patel(1875–1950),Gujarat,"Widely known as the ""Iron Man of India"",[25] P..."
3,4,NaN,Jawaharlal Nehru(1889–1964),Uttar Pradesh,"Independence activist and author, Nehru is the..."
4,5,NaN,Mother Teresa (1910–1997),"West Bengal (Born in Skopje,now North Macedonia)","""Saint Mother Teresa of Calcutta"" was a cathol..."
5,6,NaN,J. R. D. Tata(1904–1993),Maharashtra,"Industrialist, philanthropist, and aviation pi..."
6,7,NaN,Indira Gandhi(1917–1984),Uttar Pradesh,"Known as the ""Iron Lady of India"",[33] Gandhi ..."
7,8,NaN,Sachin Tendulkar(b. 1973),Maharashtra,"Having debuted in 1989, Tendulkar played 664 i..."
8,9,NaN,Atal Bihari Vajpayee (1924–2018),Madhya Pradesh,"Parliamentarian for over four decades, Vajpaye..."
9,10,NaN,Lata Mangeshkar(b. 1929),Maharashtra,"Widely credited as the ""nightingale of India"",..."